{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "dtype": "float32", "data_format": "channels_last", "filters": 32, "batch_input_shape": [null, 30, 80, 80], "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [1, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [1, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_constraint": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [1, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [1, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 128, "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_constraint": null, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 128, "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_constraint": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [1, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [1, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "valid", "kernel_size": [2, 2], "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 256, "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_constraint": null, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "valid", "kernel_size": [2, 2], "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 256, "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_constraint": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "pool_size": [1, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [1, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "units": 1024, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "use_bias": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "units": 1024, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "use_bias": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "units": 7, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "softmax", "use_bias": true}}]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"decay": 9.999999974752427e-07, "lr": 9.999999747378752e-06, "amsgrad": false, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "beta_2": 0.9990000128746033}}, "sample_weight_mode": null, "metrics": ["accuracy", "recall", "precision", "f1_score", "rmse", "f1", "precision2", "recall2"]}}, "weightsManifest": [{"paths": ["group1-shard1of12", "group1-shard2of12", "group1-shard3of12", "group1-shard4of12", "group1-shard5of12", "group1-shard6of12", "group1-shard7of12", "group1-shard8of12", "group1-shard9of12", "group1-shard10of12", "group1-shard11of12", "group1-shard12of12"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 80, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [2, 2, 128, 256], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [2, 2, 256, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [10240, 1024], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [1024, 7], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [7], "dtype": "float32"}]}]}