{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "TimeDistributed", "config": {"batch_input_shape": [null, 30, 80, 80], "trainable": true, "name": "time_distributed_1", "layer": {"class_name": "Conv1D", "config": {"padding": "same", "kernel_constraint": null, "name": "conv1d_1", "bias_regularizer": null, "kernel_size": [7], "strides": [2], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null}}, "dtype": "float32"}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "Conv1D", "config": {"padding": "valid", "kernel_constraint": null, "name": "conv1d_2", "bias_regularizer": null, "kernel_size": [3], "strides": [1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_3", "trainable": true, "layer": {"class_name": "MaxPooling1D", "config": {"padding": "valid", "name": "max_pooling1d_1", "data_format": "channels_last", "pool_size": [2], "trainable": true, "strides": [2]}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_4", "trainable": true, "layer": {"class_name": "Conv1D", "config": {"padding": "same", "kernel_constraint": null, "name": "conv1d_3", "bias_regularizer": null, "kernel_size": [3], "strides": [1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_5", "trainable": true, "layer": {"class_name": "Conv1D", "config": {"padding": "same", "kernel_constraint": null, "name": "conv1d_4", "bias_regularizer": null, "kernel_size": [3], "strides": [1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_6", "trainable": true, "layer": {"class_name": "MaxPooling1D", "config": {"padding": "valid", "name": "max_pooling1d_2", "data_format": "channels_last", "pool_size": [2], "trainable": true, "strides": [2]}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_7", "trainable": true, "layer": {"class_name": "Conv1D", "config": {"padding": "same", "kernel_constraint": null, "name": "conv1d_5", "bias_regularizer": null, "kernel_size": [3], "strides": [1], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_8", "trainable": true, "layer": {"class_name": "Conv1D", "config": {"padding": "same", "kernel_constraint": null, "name": "conv1d_6", "bias_regularizer": null, "kernel_size": [3], "strides": [1], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_9", "trainable": true, "layer": {"class_name": "MaxPooling1D", "config": {"padding": "valid", "name": "max_pooling1d_3", "data_format": "channels_last", "pool_size": [2], "trainable": true, "strides": [2]}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_10", "trainable": true, "layer": {"class_name": "Conv1D", "config": {"padding": "same", "kernel_constraint": null, "name": "conv1d_7", "bias_regularizer": null, "kernel_size": [3], "strides": [1], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_11", "trainable": true, "layer": {"class_name": "Conv1D", "config": {"padding": "same", "kernel_constraint": null, "name": "conv1d_8", "bias_regularizer": null, "kernel_size": [3], "strides": [1], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_12", "trainable": true, "layer": {"class_name": "MaxPooling1D", "config": {"padding": "valid", "name": "max_pooling1d_4", "data_format": "channels_last", "pool_size": [2], "trainable": true, "strides": [2]}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_13", "trainable": true, "layer": {"class_name": "Conv1D", "config": {"padding": "same", "kernel_constraint": null, "name": "conv1d_9", "bias_regularizer": null, "kernel_size": [3], "strides": [1], "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_14", "trainable": true, "layer": {"class_name": "Conv1D", "config": {"padding": "same", "kernel_constraint": null, "name": "conv1d_10", "bias_regularizer": null, "kernel_size": [3], "strides": [1], "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_15", "trainable": true, "layer": {"class_name": "MaxPooling1D", "config": {"padding": "valid", "name": "max_pooling1d_5", "data_format": "channels_last", "pool_size": [2], "trainable": true, "strides": [2]}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_16", "trainable": true, "layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "implementation": 1, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "return_state": false, "unit_forget_bias": true, "kernel_constraint": null, "return_sequences": false, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "recurrent_constraint": null, "recurrent_regularizer": null, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "stateful": false, "bias_constraint": null, "kernel_regularizer": null, "dropout": 0.5, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 9.999999747378752e-06, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "decay": 9.999999974752427e-07, "amsgrad": false, "beta_1": 0.8999999761581421}}, "sample_weight_mode": null, "loss_weights": null, "loss": "categorical_crossentropy", "metrics": ["accuracy", "recall", "precision", "f1_score", "rmse", "f1", "precision2", "recall2"]}}, "weightsManifest": [{"paths": ["group1-shard1of3", "group1-shard2of3", "group1-shard3of3"], "weights": [{"name": "dense_1/kernel", "shape": [256, 7], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [7], "dtype": "float32"}, {"name": "lstm_1/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "lstm_1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "time_distributed_1/kernel", "shape": [7, 80, 32], "dtype": "float32"}, {"name": "time_distributed_1/bias", "shape": [32], "dtype": "float32"}, {"name": "time_distributed_10/kernel", "shape": [3, 128, 256], "dtype": "float32"}, {"name": "time_distributed_10/bias", "shape": [256], "dtype": "float32"}, {"name": "time_distributed_11/kernel", "shape": [3, 256, 256], "dtype": "float32"}, {"name": "time_distributed_11/bias", "shape": [256], "dtype": "float32"}, {"name": "time_distributed_13/kernel", "shape": [3, 256, 512], "dtype": "float32"}, {"name": "time_distributed_13/bias", "shape": [512], "dtype": "float32"}, {"name": "time_distributed_14/kernel", "shape": [3, 512, 512], "dtype": "float32"}, {"name": "time_distributed_14/bias", "shape": [512], "dtype": "float32"}, {"name": "time_distributed_2/kernel", "shape": [3, 32, 32], "dtype": "float32"}, {"name": "time_distributed_2/bias", "shape": [32], "dtype": "float32"}, {"name": "time_distributed_4/kernel", "shape": [3, 32, 64], "dtype": "float32"}, {"name": "time_distributed_4/bias", "shape": [64], "dtype": "float32"}, {"name": "time_distributed_5/kernel", "shape": [3, 64, 64], "dtype": "float32"}, {"name": "time_distributed_5/bias", "shape": [64], "dtype": "float32"}, {"name": "time_distributed_7/kernel", "shape": [3, 64, 128], "dtype": "float32"}, {"name": "time_distributed_7/bias", "shape": [128], "dtype": "float32"}, {"name": "time_distributed_8/kernel", "shape": [3, 128, 128], "dtype": "float32"}, {"name": "time_distributed_8/bias", "shape": [128], "dtype": "float32"}]}]}